Autodesk.Revit.DB.FailureMessage.SetMessageString(System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetMessageStrings(System.String,System.String)
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.HasResolutionOfType(Autodesk.Revit.DB.FailureResolutionType)
Checks if failure has a resolution of a given type.
type:
The type of resolution.
Returns:
True if the failure has a type of resolutions, else false.
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Since:
2011

Autodesk.Revit.DB.FailureMessage.HasResolutions
Checks if the failure has any resolutions.
Returns:
True if the failure has any resolutions, false otherwise.
Since:
2011

Autodesk.Revit.DB.FailureMessage.GetDefaultResolutionCaption
Retrieves the caption of the default resolution of the failure.
Returns:
The caption of the default resolution of the failure.
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage does not have any resolutions.
Since:
2011

Autodesk.Revit.DB.FailureMessage.GetFailureDefinitionId
Retrieves the id of the failure definition for the failure.
Returns:
The id of the FailureDefinition for the failure.
Since:
2011

Autodesk.Revit.DB.FailureMessage.GetDescriptionText
Retrieves the description text of the failure.
Returns:
The description text.
Since:
2011

Autodesk.Revit.DB.FailureMessage.GetSeverity
Retrieves the severity of the failure.
Returns:
The severity of the failure.
Since:
2011

Autodesk.Revit.DB.FailureMessage.AddResolution(Autodesk.Revit.DB.FailureResolutionType,Autodesk.Revit.DB.FailureResolution)
Adds a resolution for the failure.
Remarks:
Each pair of FailureResolutionType and FailureResolution must have been defined in FailureDefinition,
and could only be added once.
type:
The type of the resolution.
resolution:
The resolution.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentException:
type is not a valid resolution type for this FailureMessage.
-or-
resolution of type is not valid for this FailureMessage.
-or-
This FailureMessage already contains a resolution of type type.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.ArgumentOutOfRangeException:
A value passed for an enumeration argument is not a member of that enumeration
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.GetAdditionalElements
Retrieves list of the additional reference elements for the failure.
Returns:
The additional elements.
Since:
2011

Autodesk.Revit.DB.FailureMessage.GetFailingElements
Retrieves list of the elements that have caused the failure.
Returns:
The elements that have caused the failure.
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetAdditionalElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets the additional reference elements for the failure.
Remarks:
Additional elements are used to highlight additional information to the user. They are not
considered as causing the failure, but are related to it. User cannot delete them in extended error dialog.
additionalElements:
The additional elements.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetAdditionalElement(Autodesk.Revit.DB.ElementId)
Sets the additional reference element for the failure.
Remarks:
Additional elements are used to highlight additional information to the user. They are not
considered as causing the failure, but are related to it. User cannot delete them in extended error dialog.
additionalElement:
The additional element.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetFailingElement(Autodesk.Revit.DB.ElementId)
Sets the element that has caused the failure.
Remarks:
In Revit error dialog this element will be highlighted to the user and can be deleted by user via extended error dialog.
id:
The element that has caused the failure.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.SetFailingElements(System.Collections.Generic.ICollection{Autodesk.Revit.DB.ElementId})
Sets elements that have caused the failure.
Remarks:
In the Revit error dialog these elements will be highlighted to the user and can be deleted by user via extended error dialog.
idsToShow:
The elements that have caused the failure.
Returns:
The FailureMessage.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Throws Autodesk.Revit.Exceptions.InvalidOperationException:
This FailureMessage is already posted to a document
Since:
2011

Autodesk.Revit.DB.FailureMessage.IsValidObject
Specifies whether the .NET object represents a valid Revit entity.
Remarks:
If the corresponding Revit native object is destroyed, or creation of the corresponding object is undone,
a managed API object containing it is no longer valid. API methods cannot be called on invalidated wrapper objects.
Returns:
True if the API object holds a valid Revit native object, false otherwise.
Since:
2014

Autodesk.Revit.DB.FailureMessage.#ctor(Autodesk.Revit.DB.FailureDefinitionId)
Creates a new FailureMessage related to a given FailureDefinition.
id:
Id of FailureDefinition.
Throws Autodesk.Revit.Exceptions.ArgumentException:
id is valid or does not have corresponding failure definition.
Throws Autodesk.Revit.Exceptions.ArgumentNullException:
A non-optional argument was NULL
Since:
2011

Autodesk.Revit.DB.FailureMessage
Represents a message describing a failure of an operation in Revit.
Remarks:
Failure messages are typically shown to the user in the Revit error dialog.
This class contains the following information about the failures:
The basic description of the failure (retrieved from the FailureDefinition)The available resolutions for the failure.The elements related to the failure.
Since:
2011